APC10x4.7/4000RPM/5mps4000rpm/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.001;
        smoother        GaussSeidel;
    }


    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0.001;
    }

}

SIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    consistent      yes;

    residualControl
    {
        U                   1e-5;
        p                   1e-5;
        "(k|epsilon|omega)" 1e-5;
    }
}

relaxationFactors
{
    equations
    {
        "U.*"           0.7;
        "k.*"           0.4;
        "epsilon.*"     0.4;
        p               0.25;
    }
}

// ************************************************************************* //
